grevaillot/svd_tools/headers/STM32H7x7_CM7/sdmmc2.h
#pragma once 

/* --- SDMMC2: SDMMC2 ----------------------------------------------- */

/** @defgroup sdmmc2_registers SDMMC2 Register
@{*/

/** SDMMC2_SDMMC_POWER SDMMC power control register **/
#define SDMMC2_SDMMC_POWER			MMIO32(SDMMC2_BASE + 0x00)
/** SDMMC2_SDMMC_CLKCR The SDMMC_CLKCR register controls the SDMMC_CK output clock, the SDMMC_RX_CLK receive clock, and the bus width. **/
#define SDMMC2_SDMMC_CLKCR			MMIO32(SDMMC2_BASE + 0x04)
/** SDMMC2_SDMMC_ARGR The SDMMC_ARGR register contains a 32-bit command argument, which is sent to a card as part of a command message. **/
#define SDMMC2_SDMMC_ARGR			MMIO32(SDMMC2_BASE + 0x08)
/** SDMMC2_SDMMC_CMDR The SDMMC_CMDR register contains the command index and command type bits. The command index is sent to a card as part of a command message. The command type bits control the command path state machine (CPSM). **/
#define SDMMC2_SDMMC_CMDR			MMIO32(SDMMC2_BASE + 0x0c)
/** SDMMC2_SDMMC_RESP1R The SDMMC_RESP1/2/3/4R registers contain the status of a card, which is part of the received response. **/
#define SDMMC2_SDMMC_RESP1R			MMIO32(SDMMC2_BASE + 0x14)
/** SDMMC2_SDMMC_RESP2R The SDMMC_RESP1/2/3/4R registers contain the status of a card, which is part of the received response. **/
#define SDMMC2_SDMMC_RESP2R			MMIO32(SDMMC2_BASE + 0x18)
/** SDMMC2_SDMMC_RESP3R The SDMMC_RESP1/2/3/4R registers contain the status of a card, which is part of the received response. **/
#define SDMMC2_SDMMC_RESP3R			MMIO32(SDMMC2_BASE + 0x1c)
/** SDMMC2_SDMMC_RESP4R The SDMMC_RESP1/2/3/4R registers contain the status of a card, which is part of the received response. **/
#define SDMMC2_SDMMC_RESP4R			MMIO32(SDMMC2_BASE + 0x20)
/** SDMMC2_SDMMC_DTIMER The SDMMC_DTIMER register contains the data timeout period, in card bus clock periods. A counter loads the value from the SDMMC_DTIMER register, and starts decrementing when the data path state machine (DPSM) enters the Wait_R or Busy state. If the timer reaches 0 while the DPSM is in either of these states, the timeout status flag is set. **/
#define SDMMC2_SDMMC_DTIMER			MMIO32(SDMMC2_BASE + 0x24)
/** SDMMC2_SDMMC_DLENR The SDMMC_DLENR register contains the number of data bytes to be transferred. The value is loaded into the data counter when data transfer starts. **/
#define SDMMC2_SDMMC_DLENR			MMIO32(SDMMC2_BASE + 0x28)
/** SDMMC2_SDMMC_DCTRL The SDMMC_DCTRL register control the data path state machine (DPSM). **/
#define SDMMC2_SDMMC_DCTRL			MMIO32(SDMMC2_BASE + 0x2c)
/** SDMMC2_SDMMC_DCNTR The SDMMC_DCNTR register loads the value from the data length register (see SDMMC_DLENR) when the DPSM moves from the Idle state to the Wait_R or Wait_S state. As data is transferred, the counter decrements the value until it reaches 0. The DPSM then moves to the Idle state and when there has been no error, the data status end flag (DATAEND) is set. **/
#define SDMMC2_SDMMC_DCNTR			MMIO32(SDMMC2_BASE + 0x30)
/** SDMMC2_SDMMC_STAR The SDMMC_STAR register is a read-only register. It contains two types of flag:Static flags (bits [29,21,11:0]): these bits remain asserted until they are cleared by writing to the SDMMC interrupt Clear register (see SDMMC_ICR)Dynamic flags (bits [20:12]): these bits change state depending on the state of the underlying logic (for example, FIFO full and empty flags are asserted and de-asserted as data while written to the FIFO) **/
#define SDMMC2_SDMMC_STAR			MMIO32(SDMMC2_BASE + 0x34)
/** SDMMC2_SDMMC_ICR The SDMMC_ICR register is a write-only register. Writing a bit with 1 clears the corresponding bit in the SDMMC_STAR status register. **/
#define SDMMC2_SDMMC_ICR			MMIO32(SDMMC2_BASE + 0x38)
/** SDMMC2_SDMMC_MASKR The interrupt mask register determines which status flags generate an interrupt request by setting the corresponding bit to 1. **/
#define SDMMC2_SDMMC_MASKR			MMIO32(SDMMC2_BASE + 0x3c)
/** SDMMC2_SDMMC_ACKTIMER The SDMMC_ACKTIMER register contains the acknowledgment timeout period, in SDMMC_CK bus clock periods. A counter loads the value from the SDMMC_ACKTIMER register, and starts decrementing when the data path state machine (DPSM) enters the Wait_Ack state. If the timer reaches 0 while the DPSM is in this states, the acknowledgment timeout status flag is set. **/
#define SDMMC2_SDMMC_ACKTIMER			MMIO32(SDMMC2_BASE + 0x40)
/** SDMMC2_SDMMC_IDMACTRLR The receive and transmit FIFOs can be read or written as 32-bit wide registers. The FIFOs contain 32 entries on 32 sequential addresses. This allows the CPU to use its load and store multiple operands to read from/write to the FIFO. **/
#define SDMMC2_SDMMC_IDMACTRLR			MMIO32(SDMMC2_BASE + 0x50)
/** SDMMC2_SDMMC_IDMABSIZER The SDMMC_IDMABSIZER register contains the buffers size when in double buffer configuration. **/
#define SDMMC2_SDMMC_IDMABSIZER			MMIO32(SDMMC2_BASE + 0x54)
/** SDMMC2_SDMMC_IDMABASE0R The SDMMC_IDMABASE0R register contains the memory buffer base address in single buffer configuration and the buffer 0 base address in double buffer configuration. **/
#define SDMMC2_SDMMC_IDMABASE0R			MMIO32(SDMMC2_BASE + 0x58)
/** SDMMC2_SDMMC_IDMABASE1R The SDMMC_IDMABASE1R register contains the double buffer configuration second buffer memory base address. **/
#define SDMMC2_SDMMC_IDMABASE1R			MMIO32(SDMMC2_BASE + 0x5c)
/** SDMMC2_SDMMC_FIFOR The receive and transmit FIFOs can be only read or written as word (32-bit) wide registers. The FIFOs contain 16 entries on sequential addresses. This allows the CPU to use its load and store multiple operands to read from/write to the FIFO.When accessing SDMMC_FIFOR with half word or byte access an AHB bus fault is generated. **/
#define SDMMC2_SDMMC_FIFOR			MMIO32(SDMMC2_BASE + 0x80)

/**@}*/


/** @defgroup sdmmc2_sdmmc_power SDMMCPOWER SDMMC power control register
@{*/

/** SDMMC2_SDMMC_POWER_DIRPOL Data and command direction signals polarity selection. This bit can only be written when the SDMMC is in the power-off state (PWRCTRL = 00). **/
#define SDMMC2_SDMMC_POWER_DIRPOL		(1 << 4)
/** SDMMC2_SDMMC_POWER_VSWITCHEN Voltage switch procedure enable. This bit can only be written by firmware when CPSM is disabled (CPSMEN = 0). This bit is used to stop the SDMMC_CK after the voltage switch command response: **/
#define SDMMC2_SDMMC_POWER_VSWITCHEN		(1 << 3)
/** SDMMC2_SDMMC_POWER_VSWITCH Voltage switch sequence start. This bit is used to start the timing critical section of the voltage switch sequence: **/
#define SDMMC2_SDMMC_POWER_VSWITCH		(1 << 2)

#define SDMMC2_SDMMC_POWER_PWRCTRL_SHIFT		0
#define SDMMC2_SDMMC_POWER_PWRCTRL_MASK		0x03
/** @defgroup sdmmc2_sdmmc_power_pwrctrl PWRCTRL SDMMC state control bits. These bits can only be written when the SDMMC is not in the power-on state (PWRCTRL?11). These bits are used to define the functional state of the SDMMC signals: Any further write will be ignored, PWRCTRL value will keep 11.
@{*/
/**@}*/


/**@}*/

